# completions
zsh-users/zsh-completions kind:fpath path:src

# oh-my-zsh
getantidote/use-omz        # handle OMZ dependencies
ohmyzsh/ohmyzsh path:lib   # load OMZ's library
# load OMZ plugins
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/terraform
ohmyzsh/ohmyzsh path:plugins/colored-man-pages

# auto suggestions
zsh-users/zsh-autosuggestions

# syntax highlighting
zdharma-continuum/fast-syntax-highlighting kind:defer